backend/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `user` WHERE `access_token`='LG-SerfMjulptp2sCSikp3N44ym04-cv'

    public function generateToken()
    {
        $this->access_token = \Yii::$app->security->generateRandomString();
        $this->save(false);
---
INSERT INTO `user` (`email`, `auth_key`) VALUES ('admin@test.com', 'y7wCryhH_Ia0F-grm65Ha9FyhXM6jXiZ')
UPDATE `user` SET `access_token`='LG-SerfMjulptp2sCSikp3N44ym04-cv' WHERE `id`=1

    public function login(){
        $user = $this->findOne(['email' => $this->email]);
---
SELECT * FROM `user` WHERE `email`='admin@test.com'